package com.company;

/*Написать консольное приложение - калькулятор и залить на GitHub.
Основные операции - сложение, вычитание, умножение, деление.
Обработка сложных выражений со скобками. Пример - 5*(2+1) + 5/2 * 3
Срок - 10 дней. */

public class Main {

    public static void main(String[] args) {
        System.out.println("Задание №1");
    }
}
